Ran Plan for dir: `terraform/cloudfront` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Gateway/14/default/terraform/cloudfront/default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Gateway/14/default/terraform/cloudfront": exit status 1
data.aws_lb.frontend_stage: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_lb.gateway: Reading...
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_lb.frontend_prod: Reading...
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
data.aws_lb.frontend_prod: Read complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/turbo-setof-web-lb/511471b72d415a14]
data.aws_lb.frontend_stage: Read complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/turbo-setof-web-stage/e86cf1b620a13a5f]
data.aws_lb.gateway: Read complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/gateway-alb-prod/09b90e55b9014192]
data.aws_acm_certificate.cloudfront_cert: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudfront_cache_policy.api_no_cache will be created
  + resource "aws_cloudfront_cache_policy" "api_no_cache" {
      + arn         = (known after apply)
      + comment     = "No caching for API requests - forward all to origin"
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "gateway-api-no-cache-prod"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "all"
            }
          + headers_config {
              + header_behavior = "whitelist"

              + headers {
                  + items = [
                      + "Accept",
                      + "Accept-Language",
                      + "Authorization",
                      + "Content-Type",
                      + "Host",
                      + "Origin",
                    ]
                }
            }
          + query_strings_config {
              + query_string_behavior = "all"
            }
        }
    }

  # aws_cloudfront_origin_request_policy.api_all_viewer will be created
  + resource "aws_cloudfront_origin_request_policy" "api_all_viewer" {
      + arn     = (known after apply)
      + comment = "Forward all viewer headers for API requests"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "gateway-api-all-viewer-prod"

      + cookies_config {
          + cookie_behavior = "all"
        }

      + headers_config {
          + header_behavior = "allViewerAndWhitelistCloudFront"

          + headers {
              + items = [
                  + "CloudFront-Forwarded-Proto",
                  + "CloudFront-Is-Mobile-Viewer",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # aws_cloudfront_response_headers_policy.api_cors will be created
  + resource "aws_cloudfront_response_headers_policy" "api_cors" {
      + arn     = (known after apply)
      + comment = "CORS headers for API responses"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "gateway-api-cors-prod"

      + cors_config {
          + access_control_allow_credentials = true
          + access_control_max_age_sec       = 86400
          + origin_override                  = false

          + access_control_allow_headers {
              + items = [
                  + "Accept",
                  + "Authorization",
                  + "Content-Type",
                  + "Origin",
                  + "X-Requested-With",
                ]
            }

          + access_control_allow_methods {
              + items = [
                  + "DELETE",
                  + "GET",
                  + "HEAD",
                  + "OPTIONS",
                  + "PATCH",
                  + "POST",
                  + "PUT",
                ]
            }

          + access_control_allow_origins {
              + items = [
                  + "https://set-of.com",
                  + "https://stage.set-of.com",
                  + "https://www.set-of.com",
                ]
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_cache_policy_id          = (known after apply)
  + api_cors_policy_id           = (known after apply)
  + api_origin_request_policy_id = (known after apply)
  + routing_summary              = {
      + production = {
          + api_origin      = "gateway-alb-prod-1837698569.ap-northeast-2.elb.amazonaws.com"
          + api_path        = "/api/v1/*"
          + domains         = [
              + "set-of.com",
              + "www.set-of.com",
            ]
          + frontend_origin = "turbo-setof-web-lb-966736915.ap-northeast-2.elb.amazonaws.com"
        }
      + staging    = {
          + api_origin      = "gateway-alb-prod-1837698569.ap-northeast-2.elb.amazonaws.com"
          + api_path        = "/api/v1/*"
          + domains         = [
              + "stage.set-of.com",
            ]
          + frontend_origin = "turbo-setof-web-stage-364308525.ap-northeast-2.elb.amazonaws.com"
        }
    }
╷
│ Error: reading ACM Certificate (arn:aws:acm:us-east-1:646886795421:certificate/24ad1686-0eb5-4ef0-9469-21cfb8cf683f): operation error ACM: GetCertificate, https response error StatusCode: 400, RequestID: 357f67d4-7e9e-4cf0-80ed-68f6a110e1f3, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/731f9812c68d49d69f47d7c93207fa8d is not authorized to perform: acm:GetCertificate on resource: arn:aws:acm:us-east-1:646886795421:certificate/24ad1686-0eb5-4ef0-9469-21cfb8cf683f because no identity-based policy allows the acm:GetCertificate action
│ 
│   with data.aws_acm_certificate.cloudfront_cert,
│   on provider.tf line 101, in data "aws_acm_certificate" "cloudfront_cert":
│  101: data "aws_acm_certificate" "cloudfront_cert" {
│ 
╵

```
</details>